performance/projects.yml
config:
  target: 'https://api.todoist.com/rest/v1'
  ensure:
   - p95: 2500
     maxErrorRate: 1
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
  defaults:
    headers:
      Authorization: 'Bearer {{ $processEnvironment.API_TOKEN }}'
scenarios:
   - flow:
     - get:
         url: "/projects"